---------------------------------------------------------------- @Note: lazydev.nvim 插件配置
--- 为 Neovim 配置、运行时及插件提供补全、注解和 API 签名支持。
--- 自动处理 `vim` 全局变量的识别，无需在 LSP 中手动配置。

-------------------------------------------------------------------------------
-- Options Components
-------------------------------------------------------------------------------

--- @Note: 获取 lazydev 的配置参数
--- @return table
local _get_opts = function()
  return {
    library = {
      -- 当代码中出现 `vim.uv` 时，加载 luvit 类型库
      { path = '${3rd}/luv/library', words = { 'vim%.uv' } },
    },
  }
end

-------------------------------------------------------------------------------
-- Core Logic
-------------------------------------------------------------------------------

--- @Note: 整合配置与初始化
local _init = function(_, opts)
  require('lazydev').setup(opts)
end

-------------------------------------------------------------------------------
-- Plugin Spec
-------------------------------------------------------------------------------

return {
  'folke/lazydev.nvim',
  ft = 'lua',
  opts = _get_opts(),
  config = _init,
}
